// Напишите программу , которая на вход принимает два числа и проверяет ,
// является ли первое число квадратом второго 

// System.Console.WriteLine(" Введите первое число ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите второе число ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if (num2*num2==num1){
//     Console.WriteLine($"{num1} квадрат {num2}");
// }
// else{
//     Console.WriteLine($"{num1} не является квадратом {num2}");
// }
