//Напишите программу , которая на входе принимает трехзначное число , 
// а на выходе показывает последнюю цифру этого числа 

// System.Console.WriteLine(" Введите трехзначное число ");

// int number = Convert.ToInt32( Console.ReadLine());

// System.Console.WriteLine(" Последняя цифра");
// System.Console.WriteLine(number % 10 );;


