/* Напишите программу , которая выводит массив из 8 элементов , 
заполненый нулями и единицами в случайном порядке
НЕ РАБОТАЕТ . 
*/

// int[ ] GetRnd(int size)
// {
//     int[ ] array = new int[ size ];
//     for( int i = 0; i < size; i ++)
//     {
//         array[ i ] = new Random( ),Next(0, 2);
//     }
//     return array;
// }
// void PrintArray(int[ ] arr)
// {
//     for( int i = 0; i < arr.Lenght; i ++)
//     {
//         System.Console.Write(arr[ i ] + " ");
//     }
// }
// int [ ] userArray = GetRnd( 8 );
// PrintArray(userArray);