/*
Задача 64: Задайте значение N. Напишите программу, которая выведет все
натуральные числа в промежутке от N до 1.
Выполнить с помощью рекурсии.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
*/

// void DigitDiapazon(int number, int start = 1)
// {
//     if (number < start)
//     {
//         return;
//     }
//     else
//     {
//         System.Console.Write(number + " ");
//         DigitDiapazon(number - 1);
//         number = number - 1;
//     }
// }

// DigitDiapazon(6);


