/*
Напишите программу , которая найдет точку пересечения двух прямых ,
заданных уравнением y=k1*x+b1, y=k2*x+b2 . Значения  b1, k1, b2, k2 задаются пользователем
*/

// System.Console.WriteLine(" Введите значение b1 ");
// double b1 = Convert.ToDouble(Console.ReadLine());

// System.Console.WriteLine(" Введите значение k1 ");
// double k1 = Convert.ToDouble(Console.ReadLine());

// System.Console.WriteLine(" Введите значение b2 ");
// double b2 = Convert.ToDouble(Console.ReadLine());

// System.Console.WriteLine(" Введите значение k2 ");
// double k2 = Convert.ToDouble(Console.ReadLine());

// /*
// Решение для полуения координат
// y=k1*x+b1, y=k2*x+b2
// k1*x+b1=k2*x+b2
// (k1-k2)*x=b2-b1
// x=(b2-b1) / (k1-k2)
// y=k1*x+b1
// */

// double x = (b2-b1) / (k1-k2);
// double y = k1*x+b2;
// System.Console.Write($" Точка пересечения прямых находится в координатах x = {x} ; y = {y} ");
