/*
Напишите программу , которая принимает на вход число 
и выдает сумму цифр в числе 
*/
// System.Console.WriteLine(" Введите ччисло ");
// int number = Convert.ToInt32(Console.ReadLine());

// int Sum(int number)
// {
//     int sum = 0;
//     while ( number>0)
//     {
//         sum += number % 10;
//         number = number / 10;
//     }
//     return sum;
// }

// System.Console.WriteLine($" Сумма цифр в числе { number} = { Sum(number) }");

