/*
Напишите метод DistanceBetweenPoints, который принимает на вход координаты двух точек pointA и pointB 
в виде массива целых чисел,
 и возвращает расстояние между ними в 3D пространстве
 */

// System.Console.WriteLine(" Введите координаты точки Ax ");
// int pointAx = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите координаты точки Ay ");
// int pointAy = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите координаты точки Az ");
// int pointAz = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите координаты точки Bx ");
// int pointBx = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите координаты точки By ");
// int pointBy = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите координаты точки Bz ");
// int pointBz = Convert.ToInt32(Console.ReadLine());

// double result = Math.Sqrt(Math.Pow((pointBx - pointAx), 2) + Math.Pow((pointBy - pointAy), 2) + Math.Pow((pointBz - pointAz), 2));
// System.Console.WriteLine(" Расстояние между точками в 3D " + Math.Round(result, 2));
