/*
Напишите программу , которая будет преобразовывать десятичное число в двоичное ( двоичная система исчисления )
*/

// Console.Clear();

// int Obraz(int num)
// {
//     int result = 0;
//     int temp = 1;
//     while(num>0)
//     {
//           result += num % 2 * temp;
//           num /= 2;
//           temp *= 10;
//     }
//     return result;
// }
//  System.Console.WriteLine(Obraz(12));
