/* Напишите программу , которая выводит третью цифру заданного числа 
 или сообщает , что третьей цифры нет .
*/

// Console.WriteLine(" Введите число ");
// int number = Convert.ToInt32(Console.ReadLine());

//    if ( number<99)
//    {
//    Console.WriteLine( " Третьей цифры нет ");
//    }
//     else 
//     {
//         number=number/100;
//         number=number%10
//         Console.WriteLine($" Третья цифра {number}");
