/*
Напишите метод , который принимает на вход пятизначное число 
и проверяет , является ли оно палиндромом 
*/
// System.Console.WriteLine(" Введите пятизначное число ");
// int number = Convert.ToInt32(Console.ReadLine());

// if( number < 9999 || number > 100000 )
// {
//     System.Console.WriteLine(" Неверное число");
// }
// int num1 = number / 10000 % 10;
// int num2 = number / 1000 % 10;
// int num3 = number /100 % 10;
// int num4 = number /10 % 10;
// int num5 = number % 10;

// int poli_num = ( num5 * 10000) + (num4 * 1000) + ( num3 * 100) + ( num2 * 10) + num1 ;
// if ( number == poli_num)
// {
//     System.Console.WriteLine(" True ");
// }
// else 
// {
//     System.Console.WriteLine(" False ");
// }