/*
Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных
 элементов в промежутке от M до N.
M = 1; N = 15 -> 120
M = 4; N = 8. -> 30
*/

// int userNumberM = 4 ;
// int userNumberN = 8 ;
// int sum = SumDigit(userNumberM, userNumberN);
// System.Console.WriteLine(sum);

// int SumDigit(int numberM, int numberN)
// {
//     if(numberM == numberN) return numberM;
//     else return numberM + SumDigit(numberM + 1, numberN);
// }