//Напишите программу , которая будет выдавать название дня недели по заданному номеру

// System.Console.WriteLine(" Введите число");
// int weekday=Convert.ToInt32(Console.ReadLine());

// int day1=1;
// int day2=2;
// int day3=3;
// int day4=4;
// int day5=5;
// int day6=6;
// int day7=7;

// if (weekday == day1) Console.WriteLine ( " Понедельник ");
// else if (weekday == day2) Console.WriteLine ( " Вторник ");
// else if (weekday == day3) Console.WriteLine ( " Среда ");
// else if (weekday == day4) Console.WriteLine ( " Четверг ");
// else if (weekday == day5) Console.WriteLine ( " Пятница ");
// else if (weekday == day6) Console.WriteLine ( " Суббота ");
// else if (weekday == day7) Console.WriteLine ( " Воскресенье ");
// else Console.WriteLine ( " Неверное число ");