/*
Напишите цикл , который принимает на вход два числа ( А и В )
и возводит число А в натуральную степень В                        
*/

// System.Console.WriteLine(" Введите числа А и В");
// int numberA = Convert.ToInt32(Console.ReadLine());
// int numberB = Convert.ToInt32(Console.ReadLine());

// int Pow(int a, int b)
// {
//     int res = 1;
//     for(int i =1; i <=b; i++)
//     {
//         res = res*a;
//     }
//     return res;
// }
// System.Console.WriteLine($" Число {numberA} в степени { numberB} = {Pow(numberA, numberB)}");
