/*
Напишите программу , которая на вход принимает трехзначное число , 
а на выходе показывает вторую цифру этого числа
*/
// Console.WriteLine(" Введите трехзначное число ");
// int number = Convert.ToInt32(Console.ReadLine());
// int new_num = (number / 10) %10; 
// {
//  if ( number<100 && number>999)
//    Console.WriteLine ("Error");
 
//  else  
//  Console.WriteLine($" Вторая цифра {new_num}");
//  }
