/*
Задайте значение N . Напишите программу , которая выведет все натуральные числа 
от 1 до N . 
*/

// void DigitDiapazon(int max, int start = 1)
// {
//     if (start > max)
//     {
//         return;
//     }
//     else
//     {
//         System.Console.Write(start + " ");
//         DigitDiapazon(max, start + 1);
//     }
// }

// DigitDiapazon(6);
