/*
Напишите программу , которая на вход принимает два числа и проверяет ,
является ли одно число квадратом другого 
*/

// System.Console.WriteLine(" Введите первое число");
// int number1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите второе число");
// int number2 = Convert.ToInt32(Console.ReadLine());
// if ( number1 == number2 * number2 || number2 == number1 * number1)
// {
//     System.Console.WriteLine(" Одно число является квадратом другого ");
// }
// else 
// {
//     System.Console.WriteLine(" Ни одно число не является квадратом другого ");
// }