/* Напишите программу , которая принимает на вход число N и выдает произведение чисел о 1 до N
*/
// System.Console.WriteLine(" Введие число ");
// int number = Convert.ToInt32(Console.ReadLine());

// int Func(int num)
// {
//     int result = 1;
//     for(int i = 2; i <=num; i++)
//     {
//         result*=i;
//     }
//     return result;
// }
// System.Console.WriteLine($" Произведениеи чисел от 1 до { number } , " + Func(number));