// Напишите программу , которая принимает на вход число и выдает колличество цифр в числе

// int Count( int a)
// {
//     int result = 0;
//     for(int i = a ;i > 0 ;i /=10 )
//     {
//         result +=1;
//     }
//     return result;
// }
// System.Console.WriteLine(" Введите число ");
// int num = Convert.ToInt32(Console.ReadLine());
// int userresult = Count(num);
// System.Console.WriteLine(userresult);
