/*
Напишите программу , которая выводит случайное число из отрезка [ 10 , 99 ] 
и показывает наибольшую цмфру этого числа 
*/

// int number = new Random().Next(10, 100);
// System.Console.WriteLine(number);

// int first = number / 10;
// int last = number % 10;

// if ( first > last )
// {
//     System.Console.WriteLine("  Первая больше ");
// }
// else if ( last > first )
// {
//     System.Console.WriteLine(" Вторая больше ");
// }
// else 
// {
//     System.Console.WriteLine(" Цифры равны ");
// }