/* Напишите метод ShowCube, который принимает на вход число (N)
 и выводит таблицу кубов чисел от 1 до N (включительно) каждое на новой строке
 */

// System.Console.WriteLine(" Введите число ");
// int number = Convert.ToInt32(Console.ReadLine());

// if ( number < 0 )
// {
//     number = number * (-1);
// }
// for( int i = 1 ; i < number + 1 ; i++)
// {
//     System.Console.WriteLine(i*i*i);
// }