// Напишите программу , которая принимает на вход три числа и 
// выдает максимальное из этих чисел

// System.Console.WriteLine(" Введите первое число");
// int n1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите второе число");
// int n2 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введите третье число");
// int n3 = Convert.ToInt32(Console.ReadLine());
// if ( n1>n2){
//     if(n1>n3){
//          }          System.Console.WriteLine($"{n1}");
// if(n2>n1){
//     if(n2>n3){
//     }               System.Console.WriteLine($"{n2}");
// if(n3>n2){
//     }               System.Console.WriteLine($"{n3}");
// }}