// Напишите программу , которая принимает на вход число и выдает ,
// является ли это число четным 

// Console.WriteLine(" Введите число");
// int number = Convert.ToInt32(Console.ReadLine());
//    if(nu
// mber %2==0)
//     Console.WriteLine($" число {number} четное");
//    else 
//       Console.WriteLine($" число {number} нечетное");