// Напишите программу , которая принимает на вход число (А) и выдает сумму чисел от 1 до (А).

// int Number1( int num)
// {
//     int sum = 0 ;
//     for(int i = 0 ;i <= num ; i++)
//     {
//         sum = sum + i;
//     }
//     return sum;
// }

// System.Console.WriteLine(" Введите число ");
// int number = Convert.ToInt32(Console.ReadLine());

// int result = Number1( number);
// System.Console.WriteLine($"сумма чисел от 1 до { number} = {result}");