/*
 Напишите программу , которая принимает на вход координаты двух очек 
 и находит растояние между ними в 2 D пространстве
 */


// System.Console.Write(" Введите координату точки A x ");
// int userAX = int.Parse(Console,ReaLine());
// System.Console.Write(" Введите координату точки A y ");
// int userAY = int.Parse(Console,ReaLine());

// System.Console.Write(" Введите координату точки B x ");
// int userBX = int.Parse(Console,ReaLine());
// System.Console.Write(" Введите координату точки B y ");
// int userBY = int.Parse(Console,ReaLine());

// double sqrX = Math.Pow(userBX - userAX , 2); 
// double sqrY = Math.Pow(userBY - userAY , 2);
// double sqrt = Math.Sqrt( sqrX + sqrY );
// System.Console.WriteLine(Math.Round(sqrt , 2));
