/*
Задайте значения M и N . Напишите программу , которая выведет все натуральные числа от  M до N
*/

// void DigitDiapazon(int max, int start )
// {
//     if (start > max)
//     {
//         return;
//     }
//     else
//     {
//         System.Console.Write(start + " ");
//         DigitDiapazon(max, start + 1);
//     }
// }

// DigitDiapazon(10, 1);



