//Напишите программу , которая на вход принимает одно числ (N) , а на выходе 
//показывает все целые числа в промежутке от - N  до N

// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());
// for ( int i = - num ; i <=num ; i++)
// {
//     Console.Write(i);
//     if( i< num);
//     System.Console.Write(", ");
// }
