/*
Напишите программу , которая на вход принимает два числа А и В 
и возводит число А в натуральную степень числа В 
*/

// int Step(int digit, int square)
// {
//     if (square == 1)
//     {
//         return digit;
//     }
//     else
//     {
//         return digit * Step(digit, square - 1);
//     }
// }

// int result = Step(5, 13);
// System.Console.WriteLine(result);;
