/*
Напишите программу , которая  будет принимать на вход два числа и выводить 
, является ли второе число кратным первому . Если второе число не кратно первому ,
то программа выводит остаток от деления 
*/

// System.Console.WriteLine(" Введие первое число");
// int number1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine(" Введие второе число");
// int number2 = Convert.ToInt32(Console.ReadLine());
// if ( number1 == number2 * number2 )
// {
//     System.Console.WriteLine(" Первое число кратно второму ");
// }
// else
// {
//     System.Console.WriteLine(number1 % number2);
//     System.Console.WriteLine(" Первое число не кратно второму ");
// }
