/*
Напишите программу , которая принимает на вход координаты точки (X и Y) , причем X и Y не равен 0
и выдает номер четверти плоскости , в которой находится эта точка 
*/

// Console.Clear();

// System.Console.WriteLine(" Задайте координату точки X ");
// int userX = int.Parse(Console.ReadLine());
// System.Console.WriteLine(" Задайте координату точки Y ");
// int userY = int.Parse(Console.ReadLine());

// if ( userX > 0 && userY > 0 )
// {
//     System.Console.WriteLine(" Точка находится в первой четверти ");
// }
// if ( userX < 0 && userY > 0 )
// {
//     System.Console.WriteLine(" Точка находится в второй четверти ");
// }
// if ( userX < 0 && userY < 0 )
// {
//     System.Console.WriteLine(" Точка находится в третьей четверти ");
// }
// if ( userX > 0 && userY < 0 )
// {
//     System.Console.WriteLine(" Точка находится в первой четверти ");
// }
// if ( userX == 0 && userY == 0 )
// {
//     System.Console.WriteLine(" Точка находится на оси координат ");
// }